[
    {
        "id": 109,
        "name": "Agnew Hall",
        "abbreviation": "AGNEW",
        "category": "Academic",
        "description": "Agnew Hall is an academic building on the Ag Quad used by the College of Agriculture and Life Sciences.\n\nIt contains space for the Department of Biological Systems Engineering and the Virginia Tech Pesticide Programs.",
        "yearBuilt": 1940,
        "address": "460 West Campus Drive",
        "latitude": 37.22476,
        "longitude": -80.42415,
        "imageFilename": "Agnew"
    },
    {
        "id": 554,
        "name": "Alphin-Stuart Livestock Teaching Arena",
        "abbreviation": "LARNA",
        "category": "Support",
        "description": "The facility includes a 125-by-250-foot ring with a prescription earthen floor, classroom space, office space, bleacher seating for 450, animal holding pens, and a kitchen/concession area.",
        "yearBuilt": 2004,
        "address": "500 Plantation Road",
        "latitude": 37.21929,
        "longitude": -80.43991,
        "imageFilename": "AlphinStuart"
    },
    {
        "id": 32,
        "name": "Ambler Johnston Hall",
        "abbreviation": "AJ",
        "category": "Residence and Dining Halls",
        "description": "Ambler Johnston Hall is a residence hall that consists of two wings connected by three cross-over lounges.\n\nEast Ambler Johnston, commonly referred to as East AJ, is home to more than 300 University Honors students living in the Honors Residential Commons. The Honors Residential Commons is a community of faculty, staff, and students who share a deep intellectual curiosity.\n\nThis program offers freshman through senior-level university honors students and graduate students an interdisciplinary opportunity to capitalize on the rich history and tradition of Virginia Tech while living and learning with faculty and students in a unique and intentional environment. It is led by two live-in faculty principals and supported by more than 30 faculty, staff, and community members.\n\nWest Ambler Johnston, commonly referred to as West AJ, is home to the Residential College at West Ambler Johnston, a community of 830 students ranging from first-year to graduate students from all academic disciplines.\n\nThe Residential College at West Ambler Johnston consists of four 'houses' of roughly 200 students, each led by a faculty member called an associate principal, a live-in graduate student called a graduate fellow and two undergraduate student leaders called resident advisors.",
        "yearBuilt": 1969,
        "address": "700, 720 Washington St. SW",
        "latitude": 37.22311,
        "longitude": -80.42105,
        "imageFilename": "AmblerJohnston"
    },
    {
        "id": 368,
        "name": "Architecture Annex",
        "abbreviation": "AA",
        "category": "Administration",
        "description": "The Architecture Annex is the main administrative building for the School of Public and International Affairs and houses the Government and International Affairs and Urban Affairs and Planning programs of the College of Architecture and Urban Studies.",
        "yearBuilt": 1916,
        "address": "140 Otey St. NW",
        "latitude": 37.2286,
        "longitude": -80.41629,
        "imageFilename": "ArchitectureAnnex"
    },
    {
        "id": 269,
        "name": "Armory",
        "abbreviation": "ARMRY",
        "category": "Academic",
        "description": "The Armory is home to the School of Visual Arts' main office, gallery, and classrooms for its foundations and drawing programs.\n\nThe structure's high ceilings and natural light furnish a striking example of innovative architectural conversion. A prominent feature of the building is a 1,700-square-foot mezzanine.\n\nThe Armory Art Gallery inside is operated as an educational and outreach service of the university. Its exhibition calendar includes work by students, faculty, and artists of regional and national importance.",
        "yearBuilt": 1936,
        "address": "201 Draper Road NW",
        "latitude": 37.22932,
        "longitude": -80.41592,
        "imageFilename": "Armory"
    },
    {
        "id": 196,
        "name": "Art and Design Learning Center",
        "abbreviation": "ART C",
        "category": "Academic",
        "description": "The Art and Design Learning Center, also known as 'the Old Print Shop', houses studios for ceramics, painting, and sculpture for the School of Visual Arts.\n\nThe building was erected in 1931 as the Mechanical Engineering Laboratory. It was renamed the Printing Plant when the print shop moved in from the First Academic Building in June 1953. The building was renovated in 1997 after the print shop relocated and got its current name in 1998.",
        "yearBuilt": 1931,
        "address": "355 Old Turner St.",
        "latitude": 37.2317,
        "longitude": -80.42072,
        "imageFilename": "ArtAndDesignLearningCenter"
    },
    {
        "id": 26,
        "name": "Barringer Hall",
        "abbreviation": "BAR",
        "category": "Residence and Dining Halls",
        "description": "Barringer Hall houses 220 male residents. Most of its rooms overlook the President's Quad, where many sporting events, cookouts, and other activities take place throughout the year.",
        "yearBuilt": 1962,
        "address": "240 Kent St.",
        "latitude": 37.22619,
        "longitude": -80.4168,
        "imageFilename": "Barringer"
    },
    {
        "id": 1861,
        "name": "Beamer-Lawson Indoor Practice Facility",
        "abbreviation": "IATF",
        "category": "Athletic",
        "description": "Everything about Virginia Tech’s Beamer-Lawson Indoor Practice Facility, from its color to its design features to its architectural touches, says 'Hokie'.\n\nThe facility is 210 feet wide and 400 feet long with a top-of-the-line synthetic turf.\n\nThe facility was renamed the Beamer-Lawson Indoor Practice Facility on Oct. 6, 2018 at a special halftime ceremony during Virginia Tech's game against Notre Dame.\n\nThe height from the playing surface to the bottom of the steel ceiling trusses is more than 86 feet at its apex, allowing plenty of room for punting and kicking. Its 8-foot padded walls, wide sidelines, full scoreboard, and 40-second clocks on each end allow the football program to hold a full-contact scrimmage.\n\nIn addition, the facility features garage-type doors, which open quickly and allow the players to move from the outdoor practice field into the indoor facility in inclement weather.\n\nThe facility also features a video platform that runs the length of the field. Three doors at separate locations lead out to observation decks to allow the video staff to film the outdoor portions of practice. Football coach Frank Beamer also has his own observation deck in the facility, with a door that leads to a deck outside for the observation of the outdoor portion of a practice.\n\nThe building has maroon trim and Hokie Stone on the bases of each support column. The archway entrance resembles that at Lane Stadium. Plus, the university’s core values – brotherhood, honor, leadership, sacrifice, service, loyalty, duty and Ut Prosim (That I May Serve) – are etched along the bases of the columns. Architects borrowed this feature from the Pylons above War Memorial Chapel.\n\nThe Athletics Department envisions men’s and women’s soccer, softball, baseball, and lacrosse all using the building for training and conditioning purposes, particularly during inclement weather in late winter and early spring.",
        "yearBuilt": 2015,
        "address": "530 Stadium Road",
        "latitude": 37.222183,
        "longitude": -80.417444,
        "imageFilename": "BeamerLawson"
    },
    {
        "id": 173,
        "name": "Bishop-Favrao Hall",
        "abbreviation": "BFH",
        "category": "Academic",
        "description": "Bishop-Favrao Hall serves the facility needs of the Department of Building Construction and the Myers-Lawson School of Construction. The building houses administrative and faculty offices and provides classroom space, seminar rooms, and studios.\n\nThe building itself was designed to be a teaching tool. The structural elements that are usually hidden behind walls and ceiling panels in other buildings are exposed and labeled. That means students can clearly see the structures they are studying in use. All public spaces and all offices have exposed ceilings to allow students and visitors to see the mechanical, electrical, plumbing, fire protection, and electrical systems.",
        "yearBuilt": 2007,
        "address": "1345 Perry St.",
        "latitude": 37.23005,
        "longitude": -80.42548,
        "imageFilename": "BishopFavrao"
    },
    {
        "id": 171,
        "name": "Burchard Hall",
        "abbreviation": "BURCH",
        "category": "Academic",
        "description": "Burchard Hall provides studio space for the architecture and industrial design programs of the School of Architecture + Design, faculty office space, and workshops for ceramics, plaster, graphics, and computer/digital media.\n\nThe building was constructed underground – with four pyramidal skylights illuminating studio spaces below – to preserve Cowgill Plaza, a popular meeting place and campus thoroughfare.\n\nA stairway leads from a kiosk in the plaza to the subterranean offices and studio space.",
        "yearBuilt": 1998,
        "address": "1327 Perry St.",
        "latitude": 37.22958,
        "longitude": -80.42441,
        "imageFilename": "Burchard"
    },
    {
        "id": 183,
        "name": "Burrows-Burleson Tennis Center",
        "abbreviation": "TC",
        "category": "Athletic",
        "description": "The 46,485-square-foot facility offers six outdoor and six indoor courts and is home to all men's and women's home tennis matches.",
        "yearBuilt": 1975,
        "address": "570 Beamer Way",
        "latitude": 37.21483,
        "longitude": -80.4193,
        "imageFilename": "BurrowsBurlesonTennisCenter"
    },
    {
        "id": 176,
        "name": "Burruss Hall",
        "abbreviation": "BUR",
        "category": "Administration",
        "description": "Burruss Hall is the main administration building on campus. It contains a 3,003-seat auditorium, a venue where major events such as commencement, presidential speeches, concerts, and arts shows are held.\n\nAdditionally, the building houses interior design and landscape architecture offices, studios, and classrooms for the College of Architecture and Urban Studies.",
        "yearBuilt": 1936,
        "address": "800 Drillfield Drive",
        "latitude": 37.229,
        "longitude": -80.42371,
        "imageFilename": "Burruss"
    },
    {
        "id": 36,
        "name": "Campbell Hall",
        "abbreviation": "CAM",
        "category": "Residence and Dining Halls",
        "description": "Campbell Hall is a residence hall in the Drillfield Community composed of two wings.\n\nEast Campbell is home to 163 female residents. Main Campbell houses 164 co-ed residents, primarily graduate students or undergraduate honors students.\n\nMain Campbell Community is a residential honors program for students who have demonstrated superior academic ability. It is a companion program to the Hillcrest Community. Students in the Main Campbell Community live with other members of the University Honors program from all academic class levels.",
        "yearBuilt": 1940,
        "address": "300, 320 Drillfield Drive",
        "latitude": 37.2262,
        "longitude": -80.42153,
        "imageFilename": "Campbell"
    },
    {
        "id": 177,
        "name": "Carol M. Newman Library",
        "abbreviation": "LIBR",
        "category": "Support",
        "description": "Established in 1872 with 500 volumes, the library now includes holdings of more than 2 million volumes physically located in Newman Library and three branches: (1) Art + Architecture, 100 Cowgill Hall, (2) Veterinary Medicine, in the Phase III Building of the Virginia-Maryland Regional College of Veterinary Medicine on Duck Pond Drive, (3) Northern Virginia Resource Service Center, 7054 Haycock Road, Falls Church, Va.\n\nThe library's mission is to provide and promote access to information resources for the achievement of the university’s objectives in learning, discovery, and engagement.\n\nNewman and the branch libraries offer a number of study spaces for individuals and groups. The branch libraries tend to be quiet spaces, while Newman has floors designated for groups to work together. Public computers are available in Newman and all of the branches.",
        "yearBuilt": 1955,
        "address": "560 Drillfield Drive",
        "latitude": 37.22876,
        "longitude": -80.41924,
        "imageFilename": "CarolMNewmanLibrary"
    },
    {
        "id": 187,
        "name": "Cassell Coliseum",
        "abbreviation": "COL",
        "category": "Athletic",
        "description": "The 229,297-square-foot facility houses a 10,052-seat basketball arena, locker rooms, two auxiliary gymnasiums, offices, and other athletic facilities.\n\nOne notable design element: The roof is supported by laminated wood arches.\n\nAlthough capacity crowds are a frequent occurrence in Cassell Coliseum, the largest crowd ever recorded was an overflow of 11,500 for Purdue on Dec. 3, 1966.",
        "yearBuilt": 1961,
        "address": "675 Washington St. SW",
        "latitude": 37.22245,
        "longitude": -80.41893,
        "imageFilename": "CassellColiseum"
    },
    {
        "id": 112,
        "name": "Cheatham Hall",
        "abbreviation": "JCH",
        "category": "Academic",
        "description": "Julian Cheatham Hall is home to the College of Natural Resources and Environment and provides classrooms and laboratories for studies in the physiology, nutrition, and genetics of trees, fish, and wildlife.\n\nIt also is home to the Virginia Water Resources Research Center and the Self-Assembled Wood Macromolecule Interface Lab.",
        "yearBuilt": 1971,
        "address": "310 West Campus Drive",
        "latitude": 37.22386,
        "longitude": -80.42265,
        "imageFilename": "Cheatham"
    },
    {
        "id": 1001,
        "name": "Classroom Building",
        "abbreviation": "NCB",
        "category": "Academic",
        "description": "Located at the corner of Perry Street and West Campus Drive, the $42 million three-story, 73,400-square-foot building contains 15 state-of-the-art classrooms and four interdisciplinary teaching laboratories with seats for more than 1,450 students, as well as study rooms and group meeting space. The new learning spaces are designed to support increasingly interactive and technology-driven learning experiences.\n\nThe classrooms have features that include moveable furnishings, wall-mounted writing spaces, and multiple screens for projecting shared material and student work. Some rooms were configured as SCALE-UP classrooms, a specific design that facilitates team-based, active learning as an alternative to lectures, even for large-enrollment classes.\n\nThe building includes rooms that can be subdivided and readily reconfigured as the instructional needs, technologies, and teaching methods change over time.\n\nThe new building was constructed to LEED certification standards, a designation given by the U.S. Green Building Council for structures that use the very best in energy and environmental design.\n\nThe location of the Classroom Building adjacent to other instructional buildings is intended to minimize travel time between classes for students and faculty. The location is also convenient to students commuting from off-campus.\n\nEYP Architecture & Engineering of Washington, D.C., designed the building, and WM Jordan Company Inc. of Newport News was the construction manager.",
        "yearBuilt": 2016,
        "address": "1455 Perry Street",
        "latitude": 37.229270,
        "longitude": -80.427207,
        "imageFilename": "ClassroomBuilding"
    },
    {
        "id": 38,
        "name": "Cochrane Hall",
        "abbreviation": "CHRNE",
        "category": "Residence and Dining Halls",
        "description": "Cochrane Hall is connected to the West End Market dining facility. The residence hall houses 333 co-ed students in four-bedroom suites. Residents in each suite can share an extra sitting area to relax or study.\n\nWest End Market is the most innovative dining center on campus and has repeatedly been recognized with national awards. It features six restaurants: Bistro Firenze, Wired, Leaf & Ladle, JP's Chop House, Seven70, and the Fighting Gobbler Sports Lounge.",
        "yearBuilt": 1982,
        "address": "770 Washington St. SW",
        "latitude": 37.22265,
        "longitude": -80.42189,
        "imageFilename": "Cochrane"
    },
    {
        "id": 175,
        "name": "College of Liberal Arts and Human Sciences Building",
        "abbreviation": "PAB",
        "category": "Administration",
        "description": "The College of Liberal Arts and Human Sciences building houses administrative units for the Office of the Dean.",
        "yearBuilt": 1900,
        "address": "200 Stanger St.",
        "latitude": 37.230591,
        "longitude": -80.420843,
        "imageFilename": "CollegeOfLAHSBuilding"
    },
    {
        "id": 172,
        "name": "Cowgill Hall",
        "abbreviation": "CO",
        "category": "Academic",
        "description": "Cowgill Hall houses the School of Architecture + Design administrative offices, as well as the College of Architecture and Urban Studies Dean’s offices. In addition, it provides space for faculty offices, classrooms, and undergraduate and graduate architecture studios.\n\nThe lobby of Cowgill Hall serves as the school’s principal exhibition space. Literature resources are also housed on the ground floor of Cowgill Hall in the Art and Architecture Library, a branch of the University’s Newman Library. Shop facilities, located adjacent to the building, provide woodworking and metalworking equipment; a ceramic workshop allows creative and analytical work with clay and plaster; a graphics workshop includes equipment for etching, embossing, and serigraphy; and there are five darkrooms plus film, video, and other photographic facilities.\n\nOutside on the southern side of the building is Cowgill Plaza, a popular meeting place. It features four pyramidal skylights that provide natural light for Burchard Hall, which was built underneath the plaza.",
        "yearBuilt": 1969,
        "address": "1325 Perry St.",
        "latitude": 37.22992,
        "longitude": -80.42474,
        "imageFilename": "Cowgill"
    },
    {
        "id": 475,
        "name": "Dairy Science Complex - Kentland Farm",
        "abbreviation": "DSC-KF",
        "category": "Support",
        "description": "The state-of-the art Dairy Science Complex includes an 11,900-square-foot milking parlor with a computerized milk-monitoring system, a 46,000-square-foot freestall barn for the 232 milking cows, a modern waste management system, a special needs heifer barn, and a pre-weaned calf facility.\n\nThe facility bolsters the long-term success of Virginia Tech’s award-winning dairy science program and contributes to the university’s land-grant mission. Students examine modern issues in dairy science alongside researchers who are working on solving challenges and sharing those solutions with Virginia Cooperative Extension.\n\nScientists collaborate with partners in the Department of Animal and Poultry Sciences, the Agricultural Technology Program, and the Virginia-Maryland College of Veterinary Medicine.\n\nThe dairy is one of many other agricultural endeavors at the nearly 1,800-acre Kentland Farm. People from around the university use it for research, education, and Extension activities, doing everything from conducting tests on row crops to advancing the use of unmanned aerial vehicles, also called drones.",
        "yearBuilt": 2016,
        "address": "5250 Whitethorne Road",
        "latitude": 37.212973,
        "longitude": -80.426147,
        "imageFilename": "DairyScienceComplex"
    },
    {
        "id": 156,
        "name": "Davidson Hall",
        "abbreviation": "DAV",
        "category": "Academic",
        "description": "Davidson Hall houses offices, classrooms, and laboratories for the chemistry department. The department is also housed in Hahn Hall North and South.\n\nDavidson Hall is joined to South Hahn Hall by a tunnel at the rear of the building.\n\nThe building, which dates to the 1930s, got a full overhaul into a modern teaching-and-research building, leaving only the original stone facade untouched. A $31.1 million renovation completed in 2014 provided 45,000 square feet of state-of-the-art lab space and a new lecture hall that seats 300 people. The Facilities Department completed a full renovation of the 28,688-square-foot historic front section of Davidson Hall in June 2018.",
        "yearBuilt": 1928,
        "address": "1040 Drillfield Drive",
        "latitude": 37.22674,
        "longitude": -80.42521,
        "imageFilename": "Davidson"
    },
    {
        "id": 155,
        "name": "Derring Hall",
        "abbreviation": "DER",
        "category": "Academic",
        "description": "Derring Hall contains offices, classrooms, and laboratory space for many of the science programs at Virginia Tech, such as biological sciences and geoscience. The Museum of Geosciences is also in the building.",
        "yearBuilt": 1969,
        "address": "926 West Campus Drive",
        "latitude": 37.22908,
        "longitude": -80.4256,
        "imageFilename": "Derring"
    },
    {
        "id": 189,
        "name": "Dietrick Hall",
        "abbreviation": "DTRIK",
        "category": "Dining",
        "description": "Dietrick Hall is a dining center. There is also a convenience store, laundry area, and central bake shop. It includes the following: (1) D2, an international, marketplace-style dining facility, opened in 2004, replacing The Depot at Dietrick. It serves breakfast, lunch, and dinner from eight shops: Salsas, with Mexican fare; Pan Asia, with wok-prepared Asian selections; Gauchos, featuring skewered meats and other Brazilian items; Mangia, with Italian pastas and more; Eden’s, with fresh vegetables and salads; East Side Deli, with made-to-order sandwiches; Olives, featuring Mediterranean vegan selections; and La Patisserie, with pastries and desserts. (2) DXpress opened in 1995 on the lower level. It offers salads, burgers, late-night meals, and breakfast sandwiches. (3) Deet's Place opened in 1994 as a specialty coffee, gourmet dessert, and ice cream shop.",
        "yearBuilt": 1970,
        "address": "285 Ag Quad Lane",
        "latitude": 37.22454,
        "longitude": -80.42111,
        "imageFilename": "Dietrick"
    },
    {
        "id": 126,
        "name": "Durham Hall",
        "abbreviation": "DURHM",
        "category": "Academic",
        "description": "Durham Hall contains laboratories, offices and classrooms for various department in the College of Engineering, including the Charles E. Via, Jr. Department of Civil and Environmental Engineering, the Department of Mechanical Engineering, the Grado Department of Industrial & Systems Engineering, and the Bradley Department of Electrical and Computer Engineering.",
        "yearBuilt": 1997,
        "address": "1145 Perry St.",
        "latitude": 37.23174,
        "longitude": -80.42382,
        "imageFilename": "Durham"
    },
    {
        "id": 22,
        "name": "Eggleston Hall",
        "abbreviation": "EGG",
        "category": "Residence and Dining Halls",
        "description": "Eggleston Hall is composed of three wings: East, Main, and West. Main Eggleston is a co-ed residence hall; West Eggleston is co-ed and houses 198 students. East Eggleston contains office space on the first floor and residential space on the second and third floors.",
        "yearBuilt": 1935,
        "address": "410, 440, 500 Drillfield Drive",
        "latitude": 37.22766,
        "longitude": -80.41938,
        "imageFilename": "Eggleston"
    },
    {
        "id": 110,
        "name": "Engel Hall",
        "abbreviation": "ENGEL",
        "category": "Academic",
        "description": "The main offices, core facilities, and most research laboratories for the Department of Biochemistry are found in Engel Hall.\n\nThere is also a Biochemistry Library that houses current research journals and personal computers for molecular graphics, modeling, and literature searches.",
        "yearBuilt": 1961,
        "address": "340 West Campus Drive",
        "latitude": 37.2234,
        "longitude": -80.42351,
        "imageFilename": "Engel"
    },
    {
        "id": 13,
        "name": "Femoyer Hall",
        "abbreviation": "FEM",
        "category": "Academic",
        "description": "Femoyer Hall is an academic building that also houses the Student Success Center, which offers free support, such as tutoring and study skills seminars to undergraduate students, and the Naval ROTC unit.",
        "yearBuilt": 1949,
        "address": "280 Stanger St.",
        "latitude": 37.23133,
        "longitude": -80.42124,
        "imageFilename": "Femoyer"
    },
    {
        "id": 123,
        "name": "Food Science and Technology Building",
        "abbreviation": "FST",
        "category": "Academic",
        "description": "The Food Science and Technology Building offers analytical instrumentation, equipment, and research-scale pilot plant facilities for use by students. The building is home to a 5,000-square-foot processing area, a pilot-scale dairy processing area, a fully equipped research winery, a cutting-edge high-pressure processing area, and laboratories equipped for modern chemical, physical, and microbiological analyses.\n\nThe building houses offices and classrooms for the Department of Food Science and Technology, the Department of Animal and Poultry Sciences, and the Meat Sales Center. Some offices in the Department of Food Science and Technology are now in the Human and Agricultural Biosciences Building I.",
        "yearBuilt": 1952,
        "address": "360 Duck Pond Drive",
        "latitude": 37.21987,
        "longitude": -80.42532,
        "imageFilename": "FoodScienceAndTechnology"
    },
    {
        "id": 111,
        "name": "Fralin Life Science Institute",
        "abbreviation": "FRALN",
        "category": "Academic",
        "description": "The Fralin Life Science Institute is an interdisciplinary research center that bring scientists from different disciplines together to solve some of biology's more complex challenges.",
        "yearBuilt": 1995,
        "address": "360 West Campus Drive",
        "latitude": 37.22411,
        "longitude": -80.42349,
        "imageFilename": "FralinLifeScienceInstitute"
    },
    {
        "id": 193,
        "name": "G. Burke Johnston Student Center",
        "abbreviation": "GBJ",
        "category": "Academic",
        "description": "Johnston Student Center provides facilities and services for students. In addition to classroom space and an information desk on the first floor and Subway and Seattle’s Best Coffee on the second floor, Johnston offers space on the third floor for relaxing and studying and  multiple meeting places that can be reserved for private functions.",
        "yearBuilt": 1990,
        "address": "920 West Campus Drive",
        "latitude": 37.22922,
        "longitude": -80.42458,
        "imageFilename": "GBurkeJohnstonStudentCenter"
    },
    {
        "id": 136,
        "name": "Goodwin Hall",
        "abbreviation": "GOODW",
        "category": "Academic",
        "description": "Goodwin Hall is the flagship building for the College of Engineering. It houses 40 instructional and research labs, eight classrooms, the Quillen Family Auditorium, and 150 offices for several engineering departments.\n\nMore than classrooms, offices, and laboratories, Goodwin Hall is a ground-breaking experiment to measure even the smallest vibrations made inside the building. The project is designed as a test bed to track data related to building design and security, occupancy monitoring for emergency response, structural health monitoring, and more.\n\nRoughly 240 accelerometers attached to 136 sensor mounts throughout the building’s ceilings will detect information on where people are within the structure, measure normal structural settling and wind loads, and track building movement resulting from earthquakes similar to the event that struck Virginia in 2011. A sensor array mounted outside the building will measure external vibrations, such as wind, the bustle of traffic on nearby Prices Fork Road, the thunderous boom of tens of thousands of Hokie fans celebrating a touchdown at Lane Stadium, and possible seismic activity.",
        "yearBuilt": 2014,
        "address": "635 Prices Fork Road",
        "latitude": 37.23237,
        "longitude": -80.42542,
        "imageFilename": "Goodwin"
    },
    {
        "id": 251,
        "name": "Graduate Life Center at Donaldson Brown",
        "abbreviation": "ALUM",
        "category": "Support",
        "description": "The Graduate Life Center at Donaldson Brown is home to 115 graduate and professional students and the Graduate School offices. It provides a hub for graduate student life, offering students opportunities to meet and collaborate with faculty and peers across disciplines, develop skills for academic and professional success, and maintain a healthy work-life balance.\n\nThe center’s primary mission is to promote graduate education and graduate community. The building is also used for events and services organized or held by or for the Graduate School, graduate students, and graduate alumni.",
        "yearBuilt": 1935,
        "address": "155 Otey St. NW",
        "latitude": 37.22822,
        "longitude": -80.41756,
        "imageFilename": "GraduateLifeCenter"
    },
    {
        "id": 122,
        "name": "Hahn Garden Pavilion and Horticulture Garden",
        "abbreviation": "HGPAV",
        "category": "Support",
        "description": "The Peggy Lee Hahn Garden Pavilion and Horticulture Garden encompasses 5.75 acres, with 5.5 acres currently developed. Used as a learning resource for plant material, landscaping concepts, and environmental awareness, the garden features perennial borders, water gardens, shade gardens, a meadow garden, and the Peggy Lee Hahn Garden Pavilion.",
        "yearBuilt": 2006,
        "address": "200 Garden Lane",
        "latitude": 37.2203,
        "longitude": -80.42447,
        "imageFilename": "HahnGardenPavilion"
    },
    {
        "id": 158,
        "name": "Hahn Hall-North Wing",
        "abbreviation": "HAHNN",
        "category": "Academic",
        "description": "Hahn Hall-North has has offices, classrooms, and labs for both the Chemistry Department and Physics Department. The building has four organic chemistry laboratories, upper-level chemistry labs, a polymer lab, computer labs, and microbiology labs.\n\nThe Physics Department occupies the first floor, which houses a lecture theatre and lab rooms for teaching and research. The building is also used for a variety of functions such as the Physics Department Commencement, open houses, and lectures.",
        "yearBuilt": 2004,
        "address": "900 West Campus Drive",
        "latitude": 37.22831,
        "longitude": -80.42626,
        "imageFilename": "HahnHallNorthWing"
    },
    {
        "id": 157,
        "name": "Hahn Hall-South Wing",
        "abbreviation": "HAHNS",
        "category": "Academic",
        "description": "Hahn Hall-South is the main research and faculty office building for the Department of Chemistry.",
        "yearBuilt": 1988,
        "address": "800 West Campus Drive",
        "latitude": 37.22791,
        "longitude": -80.42568,
        "imageFilename": "HahnHallSouthWing"
    },
    {
        "id": 197,
        "name": "Hahn Hurst Basketball Practice Center",
        "abbreviation": "BBPF",
        "category": "Athletic",
        "description": "The Hahn Hurst Basketball Practice Center, just east of Cassell Coliseum, is a state-of-the-art practice facility for men and women’s basketball. It includes memorabilia areas, coaches’ and staff offices, two basketball courts, locker rooms, film classrooms, and other amenities that enhance the university’s basketball programs.",
        "yearBuilt": 2009,
        "address": "605 Washington St. SW",
        "latitude": 37.22331,
        "longitude": -80.41831,
        "imageFilename": "HahnHurstBasketballPracticeCenter"
    },
    {
        "id": 42,
        "name": "Harper Hall",
        "abbreviation": "HARP",
        "category": "Residence and Dining Halls",
        "description": "Housing 249 co-ed students, Harper Hall is a suite-style building with either two or three rooms sharing a common living room and bathroom.\n\nIt is home to the Cranwell International Center, which serves about 2,800 international undergraduate and graduate students, faculty, and scholars (along with their families) from more than 120 nations. As the focal point for Virginia Tech's international community, the center provides a range of educational, social, and cultural programs.\n\nIn addition to responding to the needs of the international community, the Cranwell Center encourages exchanges between international students and scholars and their U.S. counterparts, including residents of Blacksburg and the New River Valley. The center plays an active role in organizing International Street Fair, an annual celebration of cultural diversity on campus and in the local community.",
        "yearBuilt": 1999,
        "address": "240 West Campus Drive",
        "latitude": 37.22275,
        "longitude": -80.42329,
        "imageFilename": "Harper"
    },
    {
        "id": 1493,
        "name": "Harry T. Peters Jr. Large Animal Clinic",
        "abbreviation": "HTPLAC",
        "category": "Support",
        "description": "The Harry T. Peters Jr. Large Animal Clinic includes most of the facilities associated with the provision of equine, cattle, llama, and alpaca, and other food and fiber animal clinical services provided by the Veterinary Teaching Hospital at the Virginia-Maryland Regional College of Veterinary Medicine. Specific facilities include the C. E. Richardson Benevolent Foundation Equine Receiving Center, the Harry Disston Large Animal Surgery, one additional major large animal surgery facility, one standing surgical facility, equine stalls, ruminant stalls, and a neonatal Intensive Care Unit.",
        "yearBuilt": 1987,
        "address": "285 Duck Pond Drive",
        "latitude": 37.21802,
        "longitude": -80.42864,
        "imageFilename": "LargeAnimalClinic"
    },
    {
        "id": 459,
        "name": "Health and Safety Building",
        "abbreviation": "HSBLD",
        "category": "Support",
        "description": "The Health and Safety Building is home to the university's Environmental Health and Safety Services, which promotes a positive, responsible, integrated safety culture at all levels of the university community. The department advocates providing a safe and healthy living, learning, and working environment and assists others in complying with regulations and mandates.",
        "yearBuilt": 1970,
        "address": "675 Research Center Drive",
        "latitude": 37.21507,
        "longitude": -80.41803,
        "imageFilename": "HealthAndSafetyBuilding"
    },
    {
        "id": 179,
        "name": "Henderson Hall",
        "abbreviation": "HOSP",
        "category": "Academic",
        "description": "Henderson Hall is home to various music, theatre, and arts programs, including the School of Performing Arts and the School of Visual Arts.\n\nThe space includes critique and seminar rooms, computer and design labs, a costume shop, a lighting lab, an editing studio, scene and design model shops, a digital fabrication studio, and a dozen practice rooms for music.\n\nIt, along with the new Theatre 101, obtained the first LEED certifications for the university for its 2009 renovation. LEED, which stands for Leadership in Energy and Environmental Design, was designed by  U.S. Green Building Council to encourage and facilitate the development of more sustainable buildings, and it is the industry standard for green buildings.",
        "yearBuilt": 1876,
        "address": "195 Alumni Mall",
        "latitude": 37.23056,
        "longitude": -80.4167,
        "imageFilename": "Henderson"
    },
    {
        "id": 54,
        "name": "Hillcrest Hall",
        "abbreviation": "HILL",
        "category": "Residence and Dining Halls",
        "description": "Hillcrest Hall houses 108 co-ed students. The hall is suite style and every two rooms share a bathroom, except for a few rooms with private baths. Hillcrest has housed scholarship athletes, then graduate students, and is now home to the Honors College and the Hillcrest Honors Living-Learning Community.\n\nThe Hillcrest Community is designed as a four-year, live-in residential honors program for students who have demonstrated superior academic ability. Students are nominated to participate based upon a review of the honors applications and are invited to join by a selection committee.",
        "yearBuilt": 1940,
        "address": "385 West Campus Drive",
        "latitude": 37.2239,
        "longitude": -80.42501,
        "imageFilename": "Hillcrest"
    },
    {
        "id": 130,
        "name": "Holden Hall",
        "abbreviation": "HOLD",
        "category": "Academic",
        "description": "Holden Hall is an academic building that houses offices, classrooms, and laboratories of the Department of Materials Science and Engineering and the Department of Mining and Mineral Engineering.\n\nIn October 2019, Virginia Tech officials announced that Holden Hall would undergo extensive renovations. Construction is expected to last through November 2021.",
        "yearBuilt": 1940,
        "address": "445 Old Turner St.",
        "latitude": 37.23036,
        "longitude": -80.42238,
        "imageFilename": "Holden"
    },
    {
        "id": 2501,
        "name": "Holtzman Alumni Center",
        "abbreviation": "HOLTZ",
        "category": "Support",
        "description": "The Holtzman Alumni Center is home to the Virginia Tech Alumni Association. The center hosts conferences, alumni events, hotel guests, weddings, and other special events. It also showcases alumni and local artists throughout the year in its second-floor gallery.",
        "yearBuilt": 2005,
        "address": "901 Prices Fork Road",
        "latitude": 37.22913,
        "longitude": -80.42961,
        "imageFilename": "HoltzmanAlumniCenter"
    },
    {
        "id": 381,
        "name": "Human and Agricultural Biosciences Building I",
        "abbreviation": "HABB1",
        "category": "Research",
        "description": "In the Human and Agricultural Biosciences Building 1, researchers and students from multiple disciplines are collaborate on issues ranging from fermentation and food safety to bioprocessing and biofuels.\n\nThese synergistic relationships allow the College of Agriculture and Life Sciences to expand its scientific reach to address critical issues concerning agriculture, food security, human health, energy, and climate change that will impact people the world over.\n\nThe building at the intersection of Duck Pond Drive and Washington Street is the first of four planned for the Human and Agricultural Biosciences Precinct, where faculty members and students from various departments within the college work together and further research, academic, and Extension efforts.\n\nIn the new building, scientists from the Department of Biological Systems Engineering develop new energy sources of energy to power the world, build water delivery systems that ensure people have clean water, find ways to combat addiction through novel new vaccines, and create new targeted drug delivery systems to fight diseases.\n\nAt the same time, researchers from the Department of Food Science and Technology find ways for industries to provide healthy food for the world, through pasteurization, fermentation, packaging, emulsion stability, probiotic culture viability, ingredient technology, and product and process development.\n\nThe 93,860-square-foot building is home to some of the most cutting-edge and advanced technologies available combined with common areas and shared spaces to increase creative collaboration.\n\nThe Human and Agricultural Biosciences Precinct will eventually allow college faculty and staff  to be located closer together, allowing for better integration and enhanced collaboration. In addition to the four buildings, it will include a full-scale chiller plant, a greenhouse complex, and a parking area.",
        "yearBuilt": 2014,
        "address": "1230 Washington St. SW",
        "latitude": 37.22023,
        "longitude": -80.42761,
        "imageFilename": "HumanAgBiosciencesI"
    },
    {
        "id": 103,
        "name": "Hutcheson Hall",
        "abbreviation": "HUTCH",
        "category": "Academic",
        "description": "Hutcheson Hall houses offices and classrooms for the College of Agriculture and Life Sciences, plus the Virginia Cooperative Extension Service and the state 4-H headquarters.\n\nIt also is home to the Department of Statistics and contains space for the Department of Agricultural and Applied Economics, and the college’s Information Technology office.",
        "yearBuilt": 1940,
        "address": "250 Drillfield Drive",
        "latitude": 37.22571,
        "longitude": -80.42284,
        "imageFilename": "Hutcheson"
    },
    {
        "id": 116,
        "name": "Institute for Critical Technology and Applied Science (ICTAS II)",
        "abbreviation": "ICTAS II",
        "category": "Research",
        "description": "ICTAS II is home to research laboratories, office space, and conference rooms. Research activity includes applied environmental biochemistry, fluvial processes, a global laboratory for bioinspired science and technology, nanobiology, nonlinear imaging and spectroscopy, organic nanostructures, pathogen ecology, pipeline corrosion, sustainable water, and a humanoid hospital.",
        "yearBuilt": 2011,
        "address": "1075 Life Science Circle",
        "latitude": 37.22075,
        "longitude": -80.42597,
        "imageFilename": "ICTASII"
    },
    {
        "id": 1872,
        "name": "Jamerson Athletic Center",
        "abbreviation": "JAMC",
        "category": "Athletic",
        "description": "Jamerson Athletic Center houses administrative offices and other facilities for the Athletics Department. Among the more notable facilities in the building are the Jim “Bulldog” Haren weight room and the Gordon D. Bowman Memorial Club Room, which is open to Hokie Club members.",
        "yearBuilt": 1982,
        "address": "21 Beamer Way",
        "latitude": 37.22207,
        "longitude": -80.4183,
        "imageFilename": "JamersonAthleticCenter"
    },
    {
        "id": 1333,
        "name": "John W. Hancock Jr. Hall",
        "abbreviation": "HAN",
        "category": "Academic",
        "description": "John W. Hancock Hall is an academic building that is home to several departments of the College of Engineering. Its auditorium is shared between the College of Architecture and Urban Studies and the university.",
        "yearBuilt": 1990,
        "address": "490 Old Turner St.",
        "latitude": 37.23016,
        "longitude": -80.42427,
        "imageFilename": "JohnWHancock"
    },
    {
        "id": 28,
        "name": "Johnson Hall",
        "abbreviation": "JOHN",
        "category": "Residence and Dining Halls",
        "description": "Johnson Hall is a residence hall that is home to 108 female students. It is part of the President's Community. The building features hallways that are painted with fun themes that help create a lively atmosphere on each floor.",
        "yearBuilt": 1965,
        "address": "500 Washington St SW",
        "latitude": 37.22554,
        "longitude": -80.41773,
        "imageFilename": "Johnson"
    },
    {
        "id": 129,
        "name": "Kelly Hall",
        "abbreviation": "KELLY",
        "category": "Research",
        "description": "Opened in 2009, Kelly Hall houses the Institute for Critical Technology and Applied Science, which supports and promotes cutting-edge research at the intersection of engineering, science, and medicine.\n\nThe building includes engineering-led research laboratories, offices, and workspaces.",
        "yearBuilt": 2008,
        "address": "325 Stanger St.",
        "latitude": 37.23108,
        "longitude": -80.42244,
        "imageFilename": "Kelly"
    },
    {
        "id": 1,
        "name": "Lane Hall",
        "abbreviation": "LANE",
        "category": "Academic",
        "description": "Lane Hall, originally known as Barracks No. 1, contains offices for disciplines in the College of Liberal Arts and Human Sciences. It is the centerpiece building of the Upper Quad.\n\nFor the Virginia Tech Corps of Cadets, it is still considered home. Today's cadets continue a 120-year-old tradition by standing retreat in front of the hall each evening. One of the oldest buildings on campus, Lane still bears hundreds of signatures scratched into its bricks and mortar by cadets. Some of those etchings date back more than 100 years.\n\nA multimillion project to return the hall to the corps is in the works. Along with modernizing the building's electrical, mechanical, and information technology systems, the renovations will include additions at the rear of Lane Hall to provide classrooms and a more suitable space for the Corps of Cadets Museum.",
        "yearBuilt": 1888,
        "address": "280 Alumni Mall",
        "latitude": 37.2309,
        "longitude": -80.41978,
        "imageFilename": "Lane"
    },
    {
        "id": 185,
        "name": "Lane Stadium / Worsham Field",
        "abbreviation": "STAD",
        "category": "Athletic",
        "description": "Billed as the toughest place in college football for opponents to play by Rivals.com, Lane Stadium seats 65,632. Lane Stadium / Worsham Field has gone through numerous changes, renovations and additions. But through it all, it has always been regarded as one of the finest places to watch – and toughest places for opponents to play – a college football game.\n\nSince the start of the 2008 football season, fans have had the opportunity to visit Virginia Tech's Hall of Fame museum located on the west side of the football stadium. Covering two stories, the museum features all Hokie sports, with galleries, display cases, and interactive screens. Individual athletes honored include All-Americans, Academic All-Americans, and Tech's Hall of Fame members. The museum is open to the public 9 a.m. to 3 p.m. Monday through Friday. It is closed on weekends and on game days.",
        "yearBuilt": 1965,
        "address": "185 Beamer Way",
        "latitude": 37.21997,
        "longitude": -80.41873,
        "imageFilename": "LaneStadium"
    },
    {
        "id": 113,
        "name": "Latham Hall",
        "abbreviation": "LATH",
        "category": "Research",
        "description": "The William C. and Elizabeth H. Latham Agriculture and Natural Resources Building provides research and office spaces, a conference room, and a lounge for the College of Agriculture and Life Sciences and the College of Natural Resources and Environment.\n\nThe building contains eight full-size growth chambers that are two stories tall and enable researchers to conduct research on life-size trees.",
        "yearBuilt": 2006,
        "address": "220 Ag Quad Lane",
        "latitude": 37.22454,
        "longitude": -80.42259,
        "imageFilename": "Latham"
    },
    {
        "id": 200,
        "name": "Lavery Hall",
        "abbreviation": "WLH",
        "category": "Academic",
        "description": "Lavery Hall, the Academic and Student Affairs Building that opened in fall 2012, includes two floors of dining in a facility called Turner Place, one floor of classrooms, and space for the Services for Students with Disabilities office.\n\nThe modern facility behind McBryde Hall on Old Turner Street offers a convenient dining location on the academic side of campus for students traveling between classes, faculty and staff members, and students commuting from off campus.\n\nThe new Dining Services facility houses eight restaurants, including a wide variety of quick breakfast and lunch options. It features national brand franchises Jamba Juice, Qdoba, and Bruegger’s Bagels, and its menus emphasize convenient, healthy choices.\n\nIn addition to the franchises, Turner Place at Lavery Hall houses original concepts created by Dining Services. These venues include an Italian-inspired pizza and pasta restaurant; an upscale chophouse with a unique wood-burning grill; a Japanese-style steakhouse with four teppanyaki grills; a large grab-and-go venue offering prepackaged sandwiches and salads; an espresso bar; a gelato bar; and a crepe station.\n\nThe venue will seat 833 indoors and 244 at patio seating, including a large dining room for the Virginia Tech Corps of Cadets. The cadets will use the dining room to support leadership training programs during weekday dinner meals.\n\nThe Services for Students with Disabilities office on the third floor of Lavery Hall provides accommodations that allow students with disabilities access to academic programs. Services include testing accommodations, note-taking, deaf and hard-of-hearing assistance, and other accommodations. Students must identify themselves to the office to be eligible to receive services.\n\nIn addition to the dining facilities and the Services for Students with Disabilities office, the new building holds six general assignment classrooms. Course offerings will vary by semester.",
        "yearBuilt": 2012,
        "address": "430 Old Turner St.",
        "latitude": 37.2311,
        "longitude": -80.42281,
        "imageFilename": "Lavery"
    },
    {
        "id": 30,
        "name": "Lee Hall",
        "abbreviation": "LEE",
        "category": "Residence and Dining Halls",
        "description": "Lee Hall is a residence hall for 811 co-ed students. It has two theme housing programs, Galileo and the Hypatia Women in Engineering Learning Community. The building contains eight floors plus a penthouse and is the tallest point in Blacksburg, Va.\n\nGalileo focuses on issues that engineers face in the growing competitive marketplace. First-year college students can apply to live in the community and are encouraged remain in the community beyond their first year. The program is a full academic year commitment.\n\nThe Hypatia community brings together female engineering students to provide encouragement and support. First-year college students can apply to live in the community and are encouraged remain in the community beyond their first year. The program is a full academic year commitment.",
        "yearBuilt": 1966,
        "address": "570 Washington St. SW",
        "latitude": 37.22454,
        "longitude": -80.41846,
        "imageFilename": "Lee"
    },
    {
        "id": 121,
        "name": "Life Sciences I Facility",
        "abbreviation": "LFSCI",
        "category": "Research",
        "description": "The building encompasses animal care facilities and life science laboratories. One floor supports cell research, one floor supports microbiology research, and the basement is a state-of-the-art small animal vivarium. The building, which provides space for more than 200 faculty, students, and staff engaged in biological research, is managed by the university rather than by a college.",
        "yearBuilt": 2007,
        "address": "970 Washington St. SW",
        "latitude": 37.22092,
        "longitude": -80.42469,
        "imageFilename": "LifeSciences1Facility"
    },
    {
        "id": 118,
        "name": "Litton-Reaves Hall",
        "abbreviation": "LITRV",
        "category": "Academic",
        "description": "Litton-Reaves Hall is an academic building. Among its occupants is the Department of Animal and Poultry Sciences, which maintains classrooms and labs inside.",
        "yearBuilt": 1981,
        "address": "175 West Campus Drive",
        "latitude": 37.2216,
        "longitude": -80.424,
        "imageFilename": "LittonReaves"
    },
    {
        "id": 7,
        "name": "Major Williams Hall",
        "abbreviation": "MAJWM",
        "category": "Academic",
        "description": "Major Williams Hall contains offices for various departments in the College of Liberal Arts and Human Sciences, including Department of Political Science, Department of History, Department of Philosophy, Department of Foreign Languages and Literatures, and Department of Geography.",
        "yearBuilt": 1957,
        "address": "220 Stanger St.",
        "latitude": 37.23106,
        "longitude": -80.42078,
        "imageFilename": "MajorWilliams"
    },
    {
        "id": 198,
        "name": "Marching Virginians Center",
        "abbreviation": "MARCH",
        "category": "Athletic",
        "description": "The Marching Virginians Center includes a lighted artificial turf practice field, a storage building, and an open air pavilion.\n\nThe 4,300-square-foot building offers space for instrument storage and percussion practice, and an attached, 7,000-square-foot pavilion provides covered space for the full band to practice, rain or shine.\n\nPreviously, the Marching Virginians stored instruments in the lower level of the baseball team's batting cage facility and rehearsed on the infield of the Johnson-Miller Track Complex.",
        "yearBuilt": 2015,
        "address": "821 Southgate Drive",
        "latitude": 37.215913,
        "longitude": -80.414957,
        "imageFilename": "MarchingVirginiansCenter"
    },
    {
        "id": 151,
        "name": "McBryde Hall",
        "abbreviation": "MCB",
        "category": "Academic",
        "description": "McBryde Hall is an academic building that contains classrooms and offices, including Department of Computer Science, Department of Engineering Education, Department of Mathematics, and Department of Sociology.\n\nThe building is a compass, of sorts. Each of its entrances face due north, south, east, and west.",
        "yearBuilt": 1972,
        "address": "225 Stanger St.",
        "latitude": 37.23062,
        "longitude": -80.42178,
        "imageFilename": "McBryde"
    },
    {
        "id": 191,
        "name": "McComas Hall",
        "abbreviation": "MCCOM",
        "category": "Athletic",
        "description": "McComas Hall houses the Thomas E. Cook Counseling Center, Charles W. Schiffert Health Center, and the Department of Recreational Sports. Its facilities include three gymnasium/volleyball courts, a cardio/weight training area, a swimming pool, aerobic studios, a suspended track, locker rooms, and a vending/lounge area. The facility receives more than 300,000 visits per year.",
        "yearBuilt": 1998,
        "address": "895 Washington St. SW",
        "latitude": 37.22069,
        "longitude": -80.4223,
        "imageFilename": "McComas"
    },
    {
        "id": 369,
        "name": "Media Annex",
        "abbreviation": "TVFLM",
        "category": "Support",
        "description": "The Media Annex houses the Environmental Design and Planning graduate student offices.",
        "yearBuilt": 1921,
        "address": "130 Otey St. NW",
        "latitude": 37.22881,
        "longitude": -80.41594,
        "imageFilename": "MediaAnnex"
    },
    {
        "id": 370,
        "name": "Media Building",
        "abbreviation": "MEDIA",
        "category": "Support",
        "description": "The Media Building provides studio space for the Institute For Creativity, Arts, and Technology. These include the digital arts and animation studio, the digital interactive sound and intermedia studio, and the cinema studio.",
        "yearBuilt": 1934,
        "address": "101 Draper Road NW",
        "latitude": 37.22882,
        "longitude": -80.41533,
        "imageFilename": "MediaBuilding"
    },
    {
        "id": 1871,
        "name": "Merryman Athletic Facility",
        "abbreviation": "MRYMN",
        "category": "Athletic",
        "description": "The Merryman Athletic Facility includes a sports medicine and a strength and conditioning complex, as well as other facilities for athletes. The Michael Vick Hallway, on the second floor, includes the 130-seat McConnell Auditorium and nine meeting rooms for use by the football team; the Hall of Legends; offices; and the video department.\n\nThe Hall of Legends provides visitors with a display of Hokie football memorabilia.",
        "yearBuilt": 1998,
        "address": "25 Beamer Way",
        "latitude": 37.22155,
        "longitude": -80.41906,
        "imageFilename": "MerrymanAthleticFacility"
    },
    {
        "id": 27,
        "name": "Miles Hall",
        "abbreviation": "MILES",
        "category": "Residence and Dining Halls",
        "description": "Miles Hall, a residence hall, is home to 217 male students.",
        "yearBuilt": 1964,
        "address": "410 Washington St. SW",
        "latitude": 37.2255,
        "longitude": -80.41696,
        "imageFilename": "Miles"
    },
    {
        "id": 203,
        "name": "Military Building",
        "abbreviation": "MIL",
        "category": "Support",
        "description": "The Military Building is home to the Air Force, Navy, and Army ROTC programs and the Joseph F. Ware, Jr. Advanced Engineering Lab. The Ware Lab contains project space for the College of Engineering’s undergraduate senior projects. The building also is the base of operations for the Virginia Tech Rescue Squad.",
        "yearBuilt": 1936,
        "address": "320 Stanger St.",
        "latitude": 37.23181,
        "longitude": -80.42153,
        "imageFilename": "MilitaryBuilding"
    },
    {
        "id": 188,
        "name": "Moss Arts Center",
        "abbreviation": "MAC",
        "category": "Support",
        "description": "The Center for the Arts at Virginia Tech and the Institute for Creativity, Arts, and Technology are headquartered in the Moss Arts Center. The 150,000-square-foot facility includes a 1,260-seat performance hall, visual arts galleries, amphitheater, four-story experimental Cube, and multiple studios. The center also offers a multimedia studio, production control room, newsroom, and associated classroom in support of the Department of Communication.",
        "yearBuilt": 2011,
        "address": "190 Alumni Mall",
        "latitude": 37.23234,
        "longitude": -80.41765,
        "imageFilename": "MossArtsCenter"
    },
    {
        "id": 55,
        "name": "New Hall West",
        "abbreviation": "NHW",
        "category": "Residence and Dining Halls",
        "description": "New Hall West, a part of the Summit Community, houses 260 co-ed upperclass and transfer students in double rooms with private baths. It also provides space to the Student Programs administrative office. New Hall West was designed with sustainability in mind and meets requirements for U.S. Green Building Council LEED silver certification.",
        "yearBuilt": 2009,
        "address": "190 West Campus Drive",
        "latitude": 37.2222,
        "longitude": -80.42273,
        "imageFilename": "NewHallWest"
    },
    {
        "id": 40,
        "name": "New Residence Hall - East",
        "abbreviation": "NRHE",
        "category": "Residence and Dining Halls",
        "description": "New Residence Hall East is home to 220 co-ed upper-class and transfer students. It is a suite-style hall with a fitness room on the first floor.\n\nIts adjacent partner hall, New Residence Hall West, was named for Irving Peddrew and Charlie Yates in 2002 and dedicated in 2003. The Commemorative Tributes Committee is charged with the naming of all university buildings. All proposals must be approved by the board of visitors. At this time, no formal proposals have been brought forward to name New Residence Hall East after a person or persons.",
        "yearBuilt": 1998,
        "address": "590 Washington St. SW",
        "latitude": 37.22554,
        "longitude": -80.41918,
        "imageFilename": "NewResidenceHallEast"
    },
    {
        "id": 24,
        "name": "Newman Hall",
        "abbreviation": "NEW",
        "category": "Residence and Dining Halls",
        "description": "Newman Hall is home to about 275 male and female residents.\n\nThe residence hall is home to several living-learning communities.\n\nREACH is a living-learning community designed to bring together first-year students on the journey of career exploration. Participants live and study together, and the community offers a group of peers with whom to work through the career exploration process.\n\nThe World program is a cross-cultural living environment for international and domestic students. This housing option is designed to foster community and provide a home-away-from-home during university break periods. Special programs such as language conversation groups, the International Friendship Host program, foreign films, and international cooking are some of the activities planned.\n\nThe Wellness Environment for Living and Learning (WELL) program includes a student-run community board students can join to gain  leadership experience and learn practical skills. ",
        "yearBuilt": 1964,
        "address": "200 Kent St.",
        "latitude": 37.22612,
        "longitude": -80.41787,
        "imageFilename": "Newman"
    },
    {
        "id": 132,
        "name": "Norris Hall",
        "abbreviation": "NOR",
        "category": "Academic",
        "description": "Norris Hall contains offices and laboratories for the Department of Engineering Science and Mechanics, as well as the Center for Peace Studies and Violence Prevention.\n\nThe building also houses space for the Global Technology Center (a state-of-the-art video teleconferencing center), a gathering space for student team projects, the IDEAS Undergraduate Learning Center (where engineering students can work with other students or teaching assistants to go over material covered in classes or labs), a biomechanics laboratory, and the Biomechanics Cluster Research Center.",
        "yearBuilt": 1962,
        "address": "495 Old Turner St.",
        "latitude": 37.22944,
        "longitude": -80.42312,
        "imageFilename": "Norris"
    },
    {
        "id": 6181,
        "name": "North End Center",
        "abbreviation": "NECTR",
        "category": "Administration",
        "description": "The North End Center is home to 10 Virginia Tech administrative departments.\n\nBuilt in 2012-13 through an agreement between Virginia Tech and the Virginia Tech Foundation, in association with Bob Pack, a local developer, the site includes a 141,000-gross-square-feet building of mixed-use office and retail space and an 800-space parking garage.\n\nThe first floor of North End Center is leased for retail and restaurant space. The university leases the remaining floors from the Virginia Tech Foundation. That space includes the following: Controller's office, Office of Sponsored Programs, Department of Human Resources, Office of Summer and Winter Sessions, Office of Capital Assets and Financial Management, Internal Audit Department, Procurement Department, Office of Research Compliance, Office of Export and Secure Research Compliance, and College of Science.\n\nThe North End Parking Garage, also leased from the foundation, provides parking for the building tenants and visitors, university faculty and staff, and visitors to the Center for the Arts.",
        "yearBuilt": 2013,
        "address": "300 Turner St. NW",
        "latitude": 37.2335,
        "longitude": -80.4205,
        "imageFilename": "NorthEndCenter"
    },
    {
        "id": 29,
        "name": "O'Shaughnessy Hall",
        "abbreviation": "OSHA",
        "category": "Residence and Dining Halls",
        "description": "The 69,211-square-foot residence hall houses approximately 335 students as the Leadership and Social Change Residential College. Its construction started in 1965 and was completed in fall 1966. Renovations were completed in 2018.",
        "yearBuilt": 1966,
        "address": "530 Washington St. SW",
        "latitude": 37.22538,
        "longitude": -80.41832,
        "imageFilename": "OShaughnessy"
    },
    {
        "id": 1002,
        "name": "Oak Lane Community",
        "abbreviation": "SPC",
        "category": "Residence and Dining Halls",
        "description": "Originally known as Special Purpose Housing, the Oak Lane Community provides residential living areas for Greek and non-Greek organizations. It is made up of 18 buildings and features recreational fields, volleyball courts, basketball courts, and a pavilion that may be reserved by on-campus groups.",
        "yearBuilt": 1983,
        "address": "Oak Lane",
        "latitude": 37.22644,
        "longitude": -80.43753,
        "imageFilename": "OakLaneCommunity"
    },
    {
        "id": 201,
        "name": "Old Security Building",
        "abbreviation": "SEC",
        "category": "Support",
        "description": "The Old Security Building houses the alumni and development offices for the College of Science.",
        "yearBuilt": 1903,
        "address": "310 Stanger St.",
        "latitude": 37.23148,
        "longitude": -80.42159,
        "imageFilename": "OldSecurityBuilding"
    },
    {
        "id": 195,
        "name": "Owens Hall",
        "abbreviation": "OWENS",
        "category": "Dining",
        "description": "Owens Dining Center is the home of Owens Food Court, which consists of 12 specialty shops serving international and American favorites. The building also contains Hokie Grill & Co., home to Pizza Hut®, Chick-fil-A®, Blue Ridge Barbecue, and Dunkin Donuts. A soup, salad, and fruit bar are offered along with deli sandwiches and bakery-style cookies. There is a large meeting room available.",
        "yearBuilt": 1939,
        "address": "150 Kent St.",
        "latitude": 37.22671,
        "longitude": -80.41889,
        "imageFilename": "Owens"
    },
    {
        "id": 153,
        "name": "Pamplin Hall",
        "abbreviation": "PAM",
        "category": "Academic",
        "description": "Pamplin Hall is an academic building that is home to the Pamplin College of Business.",
        "yearBuilt": 1957,
        "address": "880 West Campus Drive",
        "latitude": 37.22876,
        "longitude": -80.42462,
        "imageFilename": "Pamplin"
    },
    {
        "id": 455,
        "name": "Parking Services Building",
        "abbreviation": "PRKSV",
        "category": "Support",
        "description": "The building houses the main office for Parking Services.",
        "yearBuilt": 1957,
        "address": "505 Beamer Way",
        "latitude": 37.21592,
        "longitude": -80.41841,
        "imageFilename": "ParkingServices"
    },
    {
        "id": 127,
        "name": "Patton Hall",
        "abbreviation": "PAT",
        "category": "Academic",
        "description": "Patton Hall is an academic building for the Charles E. Via, Jr. Department of Civil and Environmental Engineering, as well as other university classrooms.\n\nIt houses classrooms, most faculty offices, and administrative offices of the Department of Civil and Environmental Engineering, which offers educational programs in all areas of civil engineering practice.",
        "yearBuilt": 1929,
        "address": "750 Drillfield Drive",
        "latitude": 37.22922,
        "longitude": -80.4222,
        "imageFilename": "Patton"
    },
    {
        "id": 39,
        "name": "Payne Hall",
        "abbreviation": "PAYNE",
        "category": "Residence and Dining Halls",
        "description": "Payne Hall was built in 1994 and is home to 209 co-ed residents, mostly upperclass and transfer students. It is a suite-style building with either two or three rooms sharing a common living room and bathroom.\n\nMeraki, the well-being living-learning community, is located within Payne Hall.",
        "yearBuilt": 1993,
        "address": "600 Washington St. SW",
        "latitude": 37.22582,
        "longitude": -80.42,
        "imageFilename": "Payne"
    },
    {
        "id": 2,
        "name": "Pearson Hall East",
        "abbreviation": "PHALLE",
        "category": "Residence",
        "description": "Pearson Hall East on the Upper Quad contains 234 dorm rooms with study and lounge spaces on each level. The 101,422-square-foot building has five above-ground floors and a basement. It earned LEED certification for environmentally friendly design in 2017.\n\nPearson Hall East and Pearson Hall West replaced Brodie Hall, Monteith Hall, Rasche Hall, and Thomas Hall.\n\nPearson Hall East was completed in 2015. In addition to the 500 cadets who live in the building, Skipper, the Corps of Cadets cannon, and the Corps' canine ambassador, Growley II (call sign 'Tank') also call Pearson Hall East home.",
        "yearBuilt": 2015,
        "address": "260 Alumni Mall",
        "latitude": 37.23076,
        "longitude": -80.41896,
        "imageFilename": "PearsonHallEast"
    },
    {
        "id": 3,
        "name": "Pearson Hall West",
        "abbreviation": "PHALLW",
        "category": "Residence",
        "description": "Pearson Hall West mirrors Pearson Hall East, which opened in 2015. Both are built in the Collegiate Gothic style that characterizes most of Virginia Tech’s main campus and accented with heraldry that celebrates the university’s history, the Corps, and the ROTC units.\n\nThe 99,000-square-foot Pearson Hall West contains more than 230 rooms, plus study and lounge spaces on each level.\n\nThe rooms and hallways are designed for cadets and their training needs, such as floor tiles in the hallways that are colored and spaced to help cadets practice marching and a mud room that allow cadets to properly clean equipment after outdoor training.\n\nBoth buildings’ basement levels contain a kitchen and laundry room for cadets and offices for Corps’ staff. Additionally, Pearson Hall West includes a gym, as well as workspace for the Corps’ physical trainer.\n\nBetween the two residence halls is a new plaza featuring an 80-foot flagpole and a maroon-brick sidewalk that forms the largest 'VT' on campus to connect Lane Hall, Pearson Hall East, and Pearson Hall West.",
        "yearBuilt": 2017,
        "address": "310 Alumni Mall",
        "latitude": 37.23013,
        "longitude": -80.41993,
        "imageFilename": "PearsonHallWest"
    },
    {
        "id": 41,
        "name": "Peddrew-Yates Residence Hall",
        "abbreviation": "PY",
        "category": "Residence",
        "description": "Peddrew-Yates Hall was built in 1998. It is a suite-style building and commonly referred to as 'PY'. The Ujima living-learning community is located within Peddrew-Yates Hall.\n\nUjima is an essential concept in African philosophy and is also the third principle of Kwanzaa. It means collective work and responsibility. This new living-learning community places a special emphasis on understanding the unique experiences of African-Americans in society, including their experiences in college. Ujima is open to students of all backgrounds who are interested in understanding, supporting, and learning about #BlackExcellence.",
        "yearBuilt": 1998,
        "address": "610 Washington St. SW",
        "latitude": 37.22503,
        "longitude": -80.41991,
        "imageFilename": "PeddrewYates"
    },
    {
        "id": 247,
        "name": "Perry Street Parking Deck",
        "abbreviation": "PARKP",
        "category": "Support",
        "description": "The 1,300-space parking garage is in the large commuter parking lot off of Prices Fork Road and Perry Street. Parking Services maintains a satellite office on the ground level.\n\nFaculty, staff, and visitor parking is available on levels one and two. Commuter/graduate parking is on levels three, four, and five.  A valid university parking permit is required.\n\nThe garage features an open design with large spaces on every floor and on all four sides of the building. The ceiling height was also designed to be as high as possible which allows  the maximum amount of fresh air to pass through, creating natural ventilation of the vehicle fumes. The amount of daylight that will be allowed in through these openings will also decrease the amount of time needed for the interior lights to be on.\n\nThe open structure design contributes to sustainability initiatives but it also serves a safety purpose. The daylight will allow users maximum visibility and will also allow those outside of the structure to be able to see inside which eliminates the secluded feeling that is often associated with parking structures.",
        "yearBuilt": 2010,
        "address": "1330 Perry St.",
        "latitude": 37.23086,
        "longitude": -80.42565,
        "imageFilename": "PerryStreetParkingDeck"
    },
    {
        "id": 102,
        "name": "Price Hall",
        "abbreviation": "PRICE",
        "category": "Academic",
        "description": "Price Hall is an academic building in the Ag Quad. It is home to the Entomology and Plant Pathology, Physiology, and Weed Sciences departments. The Plant Disease Clinic and Nematode Assay Clinic also are in Price Hall.",
        "yearBuilt": 1907,
        "address": "170 Drillfield Drive",
        "latitude": 37.22574,
        "longitude": -80.42408,
        "imageFilename": "Price"
    },
    {
        "id": 31,
        "name": "Pritchard Hall",
        "abbreviation": "PRIT",
        "category": "Residence",
        "description": "Pritchard Hall is home to more than 1,000 male and female students.\n\nInside the building, you will find several living-learning communities.\n\nThrive is designed to provide first-year students with an opportunity to build community, develop relationships, and engage in programs that will enhance their first-year experience on campus and help them stay motivated throughout their time at the university.\n\nInnovate is a community of entrepreneurs, visionaries, business leaders, tech enthusiasts, knowledge aficionados, learning devotees, and small business fanatics who together have one common goal: to transform opportunities into action. Innovate is open to students of all academic majors.\n\nStudio 72 encourages creative approaches to problem solving, with an emphasis on collaborative art-making in both curricular and co-curricular settings. Each academic year will culminate in a student-run showcase of art created by students in collaboration with one another.\n\nTransfer Experience gives its members an instant peer network of others who also have some post-secondary education and are transitioning Virginia Tech.\n\nVIA consists of students who are currently enrolled as majors in University Studies.",
        "yearBuilt": 1967,
        "address": "630 Washington St. SW",
        "latitude": 37.22433,
        "longitude": -80.41974,
        "imageFilename": "Pritchard"
    },
    {
        "id": 190,
        "name": "Public Safety Building",
        "abbreviation": "SGCTR",
        "category": "Support",
        "description": "Formerly home to administrative offices, the Southgate Center is now a public safety building and for the Virginia Tech Police Department and the Office of Emergency Management. It is now called the Public Safety Building. Additional space will be available for 'surge space' when academic programs are displaced during future renovation projects.",
        "yearBuilt": 1987,
        "address": "330 Sterrett Dr.",
        "latitude": 37.21887,
        "longitude": -80.41612,
        "imageFilename": "PublicSafetyBuilding"
    },
    {
        "id": 133,
        "name": "Randolph Hall",
        "abbreviation": "RAND",
        "category": "Academic",
        "description": "Randolph Hall is an academic building that is used largely by the College of Engineering.\n\nThe building is home to many research spaces. A 6-foot-tall stability wind tunnel, acquired from National Aeronautics and Space Administration in 1958, is attached to the building. Valued at $1 million at the time, the tunnel was acquired for about $1,700 as surplus equipment.",
        "yearBuilt": 1959,
        "address": "460 Old Turner St.",
        "latitude": 37.2304,
        "longitude": -80.42368,
        "imageFilename": "Randolph"
    },
    {
        "id": 186,
        "name": "Rector Field House",
        "abbreviation": "RFH",
        "category": "Athletic",
        "description": "Rector Field House contains a full-size AstroTurf football field and a 200-meter, banked indoor track.\n\nIn addition to being the primary indoor facility for the track and field program, Rector Field House is also used as a practice facility for numerous other sports, primarily football.",
        "yearBuilt": 1971,
        "address": "230 Beamer Way",
        "latitude": 37.21899,
        "longitude": -80.42168,
        "imageFilename": "RectorFieldHouse"
    },
    {
        "id": 1492,
        "name": "Richard B. Talbot Educational Resources Center",
        "abbreviation": "RBTERC",
        "category": "Academic",
        "description": "Dedicated in 1996 as part of the Virginia-Maryland Regional College of Veterinary Medicine, the Richard B. Talbot Educational Resources Center includes two auditorium-style lecture halls with audiovisual support systems, three multidisciplinary learning laboratories, a computer laboratory, a library, and the College Center — a multipurpose facility that serves as a student center and a convocation area. It also includes study areas, student offices, and a food service center. ",
        "yearBuilt": 1996,
        "address": "265 Duck Pond Drive",
        "latitude": 37.2177,
        "longitude": -80.42839,
        "imageFilename": "RichardBTalbot"
    },
    {
        "id": 154,
        "name": "Robeson Hall",
        "abbreviation": "ROB",
        "category": "Academic",
        "description": "Robeson Hall is an academic building that is home to the Department of Physics.",
        "yearBuilt": 1960,
        "address": "850 West Campus Drive",
        "latitude": 37.22783,
        "longitude": -80.42518,
        "imageFilename": "Robeson"
    },
    {
        "id": 101,
        "name": "Sandy Hall",
        "abbreviation": "SANDY",
        "category": "Academic",
        "description": "Sandy Hall is an academic building on the Ag Quad. This building houses offices in the Department of Population Health Sciences and the Masters of Public Health program.",
        "yearBuilt": 1924,
        "address": "210 Drillfield Drive",
        "latitude": 37.2258,
        "longitude": -80.42351,
        "imageFilename": "Sandy"
    },
    {
        "id": 106,
        "name": "Saunders Hall",
        "abbreviation": "SAUND",
        "category": "Academic",
        "description": "Saunders Hall is an academic building on the Ag Quad used primarily by the Department of Horticulture. The Department of Entomology uses space in this building, and the Plant Tissue lab and Soils lab are also in Saunders Hall.",
        "yearBuilt": 1931,
        "address": "490 West Campus Drive",
        "latitude": 37.22495,
        "longitude": -80.42436,
        "imageFilename": "Saunders"
    },
    {
        "id": 108,
        "name": "Seitz Hall",
        "abbreviation": "SEITZ",
        "category": "Academic",
        "description": "Seitz Hall is an academic building on the Ag Quad and home to the Department of Biological Systems Engineering.\n\nThe department, one of the oldest such departments in the country, was established under the original name, Agricultural Engineering, in 1920 to provide support for the food and fiber industry.\n\nSome offices in the Department of Biological Systems Engineering are now in the Human and Agricultural Biosciences Building I.",
        "yearBuilt": 1940,
        "address": "155 Ag Quad Lane",
        "latitude": 37.22448,
        "longitude": -80.42361,
        "imageFilename": "Seitz"
    },
    {
        "id": 6,
        "name": "Shanks Hall",
        "abbreviation": "SHANK",
        "category": "Academic",
        "description": "Shanks Hall is an academic building that houses the English and Communication departments.",
        "yearBuilt": 1957,
        "address": "181 Turner St. NW",
        "latitude": 37.23185,
        "longitude": -80.41983,
        "imageFilename": "Shanks"
    },
    {
        "id": 2502,
        "name": "Skelton Conference Center",
        "abbreviation": "SCC",
        "category": "Support",
        "description": "The Skelton Conference Center is part of The Inn at Virginia Tech. It offers a variety of meeting facilities, including a large ballroom that may be used in different configurations. Its distinctive clock tower makes it a campus landmark. Also part of the complex is the Holtzman Alumni Center.",
        "yearBuilt": 2005,
        "address": "901 Prices Fork Road",
        "latitude": 37.22962,
        "longitude": -80.42949,
        "imageFilename": "SkeltonConferenceCenter"
    },
    {
        "id": 35,
        "name": "Slusher Hall",
        "abbreviation": "SLUSH",
        "category": "Residence",
        "description": "Slusher Hall is made up of two sections: Slusher Wing and Slusher Tower.\n\nSlusher Wing is home to about 300 male and female students. It has three floors, but they are numbered two through four because of the way the wing connects to Slusher Tower.\n\nSlusher Tower is home to about 330 male and female students. This section of the hall has 12 stories.",
        "yearBuilt": 1972,
        "address": "201 Ag Quad Lane",
        "latitude": 37.22514,
        "longitude": -80.42219,
        "imageFilename": "Slusher"
    },
    {
        "id": 194,
        "name": "Smith Career Center (Career and Professional Development)",
        "abbreviation": "CSB",
        "category": "Support",
        "description": "The Garnett E. and Patsy T. Smith Career Center (Career Services Building) provides space for Career and Professional Development. More than 24,000 students use the office’s services each year, and more than 3,000 employers have registered with the center.",
        "yearBuilt": 2004,
        "address": "870 Washington St. SW",
        "latitude": 37.22156,
        "longitude": -80.42257,
        "imageFilename": "SmithCareerCenter"
    },
    {
        "id": 105,
        "name": "Smyth Hall",
        "abbreviation": "SMYTH",
        "category": "Academic",
        "description": "Smyth Hall is an academic building on the Ag Quad. It houses offices and classrooms for several departments, including the Department of Crop and Soil Environmental Science. Three bird gargoyles adorn the building.",
        "yearBuilt": 1950,
        "address": "185 Ag Quad Lane",
        "latitude": 37.22498,
        "longitude": -80.42315,
        "imageFilename": "Smyth"
    },
    {
        "id": 275,
        "name": "Solitude",
        "abbreviation": "SOL",
        "category": "Support",
        "description": "Solitude is the oldest structure still standing on campus. The frame house was restored in 2011 to its mid-to-late 19th century appearance. It is now home to a multi-use Appalachian Center.",
        "yearBuilt": 1840,
        "address": "705 West Campus Drive",
        "latitude": 37.22622,
        "longitude": -80.42689,
        "imageFilename": "Solitude"
    },
    {
        "id": 180,
        "name": "Squires Student Center",
        "abbreviation": "SQUIR",
        "category": "Support",
        "description": "Squires Student center consists of an inner core (the original Squires Hall) and surrounding buildings added later. The facility contains two ballrooms, a 510-seat theater, a food court and dining areas, various activity rooms, meeting rooms, an art gallery, lounges, music and theater production spaces, offices and practice rooms for the music department, and offices for student publications and Student Engagement and Campus Life.",
        "yearBuilt": 1937,
        "address": "290 College Ave.",
        "latitude": 37.22962,
        "longitude": -80.41796,
        "imageFilename": "SquiresStudentCenter"
    },
    {
        "id": 120,
        "name": "Steger Hall",
        "abbreviation": "STEG",
        "category": "Research",
        "description": "The building is part of the Fralin Life Sciences Institute, an instrument of strategic university investment committed to enhancing the quality, quantity, and competitiveness of life sciences research, education, and outreach across Virginia Tech.\n\nOn Nov. 11, 2016, the building was dedicated and renamed to Steger Hall, in honor of Charles W. Steger, who served as Virginia Tech's president from 2000-2014.",
        "yearBuilt": 2004,
        "address": "1015 Life Science Circle",
        "latitude": 37.2208,
        "longitude": -80.42609,
        "imageFilename": "Steger"
    },
    {
        "id": 242,
        "name": "Sterrett Facility Complex",
        "abbreviation": "STCTR",
        "category": "Support",
        "description": "The Sterrett Facility Complex houses offices and shops of maintenance workers, carpenters, facility engineers, architects, and other support services. The largest building in the complex is the Sterrett Center, an administration building that is home to Facilities Services and University Design and Construction, among others. ",
        "yearBuilt": 1958,
        "address": "230 Sterrett Dr.",
        "latitude": 37.21965,
        "longitude": -80.41372,
        "imageFilename": "SterrettFacilityComplex"
    },
    {
        "id": 192,
        "name": "Student Services Building",
        "abbreviation": "SSB",
        "category": "Support",
        "description": "The Student Services Building combines such functions as Financial Aid, the Registrar's Office, and the Bursar's Office. There are also offices for Communications Network Services and Hokie Passport Services.",
        "yearBuilt": 2003,
        "address": "800 Washington St. SW",
        "latitude": 37.22208,
        "longitude": -80.42183,
        "imageFilename": "StudentServicesBuilding"
    },
    {
        "id": 170,
        "name": "Surge Space Building",
        "abbreviation": "SURGE",
        "category": "Academic",
        "description": "The building provides space to temporarily house academic or administrative units that are displaced because of renovations to their home buildings. The facility was designed using a pre-engineered steel frame with its exterior clad in metal panels and precast concrete-like panel accents. The building is designed to be disassembled and recycled in 10 or 15 years.",
        "yearBuilt": 2007,
        "address": "400 Stanger St.",
        "latitude": 37.23301,
        "longitude": -80.423,
        "imageFilename": "SurgeSpaceBuilding"
    },
    {
        "id": 274,
        "name": "The Grove",
        "abbreviation": "GROVE",
        "category": "Residence",
        "description": "The Grove is the residence for the university president. It sits on a knoll above the Duck Pond and is built in the Colonial Revival style. In addition to residence space for the president and family, there are rooms on the first floor for entertaining and guest rooms.",
        "yearBuilt": 1902,
        "address": "225 Grove Lane",
        "latitude": 37.22432,
        "longitude": -80.42731,
        "imageFilename": "TheGrove"
    },
    {
        "id": 2503,
        "name": "The Inn at Virginia Tech",
        "abbreviation": "VTINN",
        "category": "Support",
        "description": "As the largest hotel and conference center in Blacksburg, Va., the Inn at Virginia Tech and Skelton Conference Center offers nearly 24,000 square feet of conference space, including a 700-seat ballroom, 10 conference rooms, and 147 hotel rooms and suites.\n\nGuests may choose from two main dining options: Preston’s, a full-service restaurant and the more informal Continental Divide Lounge. Two private dining rooms, the 1872 Salon and the Old Guard, are available for smaller groups.\n\nBenchmark Hospitality International, a Texas-based luxury hotel and resort company, took over management of the facility in January 2011.\n\nThe adjacent Holtzman Alumni Center houses the Virginia Tech Alumni Association and offices for associated university personnel, as well as the Grand Hall, museum, special collections library, and meeting rooms.",
        "yearBuilt": 2005,
        "address": "901 Prices Fork Road",
        "latitude": 37.22994,
        "longitude": -80.43005,
        "imageFilename": "TheInnAtVT"
    },
    {
        "id": 169,
        "name": "Theatre 101",
        "abbreviation": "T101",
        "category": "Academic",
        "description": "Theatre 101 is an academic building with a high-tech black box performance space nestled in the L-shape of Henderson Hall. It contains a large performance space with high-end computer-controlled systems, and rehearsal space on the second floor. The facility is home to the School of Performing Arts.",
        "yearBuilt": 2009,
        "address": "200 College Ave.",
        "latitude": 37.23018,
        "longitude": -80.41634,
        "imageFilename": "Theatre101"
    },
    {
        "id": 174,
        "name": "Torgersen Hall",
        "abbreviation": "TORG",
        "category": "Academic",
        "description": "Called the Advanced Communications and Information Technology Center in the building proposal and during construction, Torgersen includes 30 miles of fiber-optic cable and 75 miles of copper cable. It houses offices, laboratory space, classrooms, space for televised distance learning, and two auditoriums. The first floor includes an atrium with computer hookups that serves as an electronic study court. The building joins Newman Library via an enclosed bridge that spans Alumni Mall and provides reading-room space.\n\nVisually, the electronic reading room that occupies the arch spanning Alumni Mall is the most stunning part of the building. Couches, the huge open space, and cherry wood covering the arched ceilings give it the feel of the old library reading room. The rest of the building mostly consists of offices and laboratory space designed specifically for the occupants.",
        "yearBuilt": 2000,
        "address": "620 Drillfield Drive",
        "latitude": 37.22978,
        "longitude": -80.41997,
        "imageFilename": "Torgersen"
    },
    {
        "id": 178,
        "name": "University Bookstore",
        "abbreviation": "BOOK",
        "category": "Support",
        "description": "The on-campus bookstore is operated by Follett Higher Education Group Inc. The building, when viewed from above, is roughly the same shape as the state of Virginia.\n\nUnder a partnership contract approved by the Virginia Tech Services Executive Committee in March 2019, Follett now manages the University Bookstore, Volume Two Bookstore, Dietrick Convenience Store, the North End Center Hokie Centric, and North End Center Starbucks, as well as various websites, catalogs, and stadium athletics stores. Virginia Tech Services, Inc. continues to oversee retail and vending contract performance.",
        "yearBuilt": 1975,
        "address": "115 Kent St.",
        "latitude": 37.22816,
        "longitude": -80.41857,
        "imageFilename": "UniversityBookstore"
    },
    {
        "id": 25,
        "name": "Vawter Hall",
        "abbreviation": "VAW",
        "category": "Residence",
        "description": "Vawter Hall is a residence hall for 326 male students. The building has a Z-like floor layout, unlike any of the other residence halls.",
        "yearBuilt": 1962,
        "address": "180 Kent St.",
        "latitude": 37.22684,
        "longitude": -80.41765,
        "imageFilename": "Vawter"
    },
    {
        "id": 295,
        "name": "Virginia Tech Golf Course Pro Shop",
        "abbreviation": "GC",
        "category": "Support",
        "description": "The Virginia Tech Golf Course Pro Shop offers a comprehensive line of services. The facility has retail space, locker rooms, a vending area, club and pull cart rentals, and the office of the director of golf operations. Club repair service is available, as well.",
        "yearBuilt": 1910,
        "address": "1085 Duck Pond Drive",
        "latitude": 37.22509,
        "longitude": -80.43385,
        "imageFilename": "GolfCourseProShop"
    },
    {
        "id": 149,
        "name": "Virginia-Maryland Regional College of Veterinary Medicine",
        "abbreviation": "VM",
        "category": "Academic",
        "description": "The Virginia-Maryland Regional College of Veterinary Medicine is housed in four buildings on the Blacksburg, Va., campus, all serving the academic needs of the college.\n\nFounded by the Virginia General Assembly in 1978, the college is a regional professional school built upon the foundations of two of the nation's leading land-grant universities: Virginia Tech and the University of Maryland at College Park. The college operates three campuses, including the main campus installation at Virginia Tech, the Avrum Gudelsky Veterinary Center at College Park, Maryland, and the Marion duPont Scott Equine Medical Center in Leesburg, Virginia.",
        "yearBuilt": 1983,
        "address": "Duck Pond Drive",
        "latitude": 37.21803,
        "longitude": -80.42744,
        "imageFilename": "VeterinaryMedicine"
    },
    {
        "id": 249,
        "name": "Visitor and Undergraduate Admissions Center",
        "abbreviation": "VUAC",
        "category": "Support",
        "description": "The Visitor and Undergraduate Admissions Center reflects the Collegiate Gothic architecture prevalent on campus and defines the Prices Fork Road entrance as the “front door” to the campus. The building provides a central location for university visitors to attend undergraduate admissions information sessions, campus tours, receive their visitor's parking permit, as well as gather other information relative to their visit.",
        "yearBuilt": 2011,
        "address": "925 Prices Fork Road",
        "latitude": 37.23117,
        "longitude": -80.43359,
        "imageFilename": "VisitorAndUGAdmissionsCenter"
    },
    {
        "id": 115,
        "name": "Wallace Hall",
        "abbreviation": "WAL",
        "category": "Administration",
        "description": "Wallace Hall contains the administrative offices for the College of Liberal Arts and Human Sciences, as well as the college's Department of Apparel, Housing, and Resource Management and the Department of Human Development. It includes the following: Department of Hospitality and Tourism Management, Department of Human Nutrition, Food, and Exercise, Center for Gerontology, Adult Day Services, and Child Development Center for Learning and Research.",
        "yearBuilt": 1966,
        "address": "295 West Campus Drive",
        "latitude": 37.22297,
        "longitude": -80.42427,
        "imageFilename": "Wallace"
    },
    {
        "id": 181,
        "name": "War Memorial Chapel",
        "abbreviation": "CHAP",
        "category": "Support",
        "description": "The upper level contains Memorial Court with eight sculptured Indiana limestone pylons representing, from left to right: Brotherhood, Honor, Leadership, Sacrifice, Service, Loyalty, Duty, and Ut Prosim (the University motto: 'That I May Serve').\n\nThe names of alumni who have died while in military service are carved on the pylons.\n\nThe four left pylons were designed by Henry Kries; the right pylons were designed by Charles Rudy. Centered at the back of Memorial Court is a cenotaph, which contains names of the seven alumni awarded the Medal of Honor.\n\nThe lower level (War Memorial Chapel) contains a 6,324-square-foot, 260-seat chapel. A chancel sculpture, designed by Donald DeLue, symbolizes humankind’s relationship to the creator with a central group implying that something greater than humans is responsible for their presence on Earth. The left figure represents this relationship in daily life; the right figure suggests humans in communion with their creator. ",
        "yearBuilt": 1960,
        "address": "601 Drillfield Drive",
        "latitude": 37.22885,
        "longitude": -80.42045,
        "imageFilename": "WarMemorialChapel"
    },
    {
        "id": 182,
        "name": "War Memorial Hall",
        "abbreviation": "GYM",
        "category": "Support",
        "description": "The building is home to Recreational Sports gym facilities and is used by the School of Education and the Department of Human Nutrition, Foods, and Exercise.\n\nThe gym provides students, faculty, and staff an area to pursue sport and recreational activities, such as racquetball, basketball, aerobics, and swimming.\n\nThe Virginia Tech Police Department maintains a substation in the building.",
        "yearBuilt": 1926,
        "address": "370 Drillfield Drive",
        "latitude": 37.22629,
        "longitude": -80.42059,
        "imageFilename": "WarMemorialHall"
    },
    {
        "id": 134,
        "name": "Whittemore Hall",
        "abbreviation": "WHIT",
        "category": "Academic",
        "description": "Whittemore Hall is used for academic classrooms and laboratories, largely for the Bradley Department of Electrical and Computer Engineering.",
        "yearBuilt": 1971,
        "address": "1185 Perry St.",
        "latitude": 37.23107,
        "longitude": -80.42445,
        "imageFilename": "Whittemore"
    },
    {
        "id": 1461,
        "name": "William E. Lavery Animal Health Research Center",
        "abbreviation": "VM4C2",
        "category": "Research",
        "description": "The William E. Lavery Animal Health Research Center includes more than 65  laboratories and several related research facilities designed to support clinical and basic research at the Virginia-Maryland Regional College of Veterinary Medicine. Major laboratories include: Biochemistry/Pharmacology Resource Laboratory, Flow Cytometry Resource Laboratory, Physiology and Clinical Research Laboratory, Toxicology Resource Laboratory, Ultrastructure Resource Laboratory, Clinical Nutrition Laboratory, Center for Neurotoxicity Studies, and Epidemiology and Statistics Consulting Laboratory.",
        "yearBuilt": 1995,
        "address": "295 Duck Pond Drive",
        "latitude": 37.21713,
        "longitude": -80.42663,
        "imageFilename": "LaveryAnimalHealth"
    },
    {
        "id": 152,
        "name": "Williams Hall",
        "abbreviation": "WMS",
        "category": "Academic",
        "description": "Williams Hall houses offices and classroom for the Department of Psychology.",
        "yearBuilt": 1953,
        "address": "890 Drillfield Drive",
        "latitude": 37.22784,
        "longitude": -80.42435,
        "imageFilename": "Williams"
    },
    {
        "id": 276,
        "name": "Wright House",
        "abbreviation": "WRIGHT",
        "category": "Academic",
        "description": "The Wright House contains the Interdisciplinary Center for Applied Mathematics, which facilitates interdisciplinary research and education in applied mathematics.\n\nThe entrance area is open with computer access for visitors. Eight offices provide the primary research space for most core faculty members. Basement offices are available to graduate students working with faculty members.",
        "yearBuilt": 1923,
        "address": "765 West Campus Drive",
        "latitude": 37.22683,
        "longitude": -80.42617,
        "imageFilename": "WrightHouse"
    }
]
